**Pandas tutorial**

In [1]:
import numpy as np
import pandas as pd

In [2]:
dict = {
    "name":['harry','rohan','skillf'],
    "marks":[93,45,67],
    "city":["batala","rhydham","ankush"]
}

In [3]:
df = pd.DataFrame(dict)

In [4]:
df

     name  marks     city
0   harry     93   batala
1   rohan     45  rhydham
2  skillf     67   ankush

In [5]:
df.to_csv("friends.csv",index=False)

In [6]:
df.head(2)

    name  marks     city
0  harry     93   batala
1  rohan     45  rhydham

In [7]:
df.tail(2)

     name  marks     city
1   rohan     45  rhydham
2  skillf     67   ankush

In [8]:
df.describe()

           marks
count   3.000000
mean   68.333333
std    24.027762
min    45.000000
25%    56.000000
50%    67.000000
75%    80.000000
max    93.000000

In [15]:
harry = pd.read_csv("friends.csv")

In [16]:
harry

     name  speed     city
0   harry     93   batala
1   rohan     45  rhydham
2  skillf     67   ankush

In [18]:
harry['speed']

0    93
1    45
2    67
Name: speed, dtype: int64

In [19]:
harry['speed'][0] = 50

/tmp/ipykernel_2597/1463362376.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry['speed'][0] = 50

In [20]:
harry

     name  speed     city
0   harry     50   batala
1   rohan     45  rhydham
2  skillf     67   ankush

In [21]:
harry.to_csv("friends.csv",index=False)

In [23]:
harry.index = ['first','second','third']

In [24]:
harry

          name  speed     city
first    harry     50   batala
second   rohan     45  rhydham
third   skillf     67   ankush